src/InformationRegisters/кфкИсходящиеСообщения/кфкИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкИсходящиеСообщения</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.кфкСтатусыСообщений</types>
    </type>
  </resources>
  <resources>
    <name>ИсходныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КлючСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Заголовки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ТелоСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Продюсер</name>
    <type>
      <types>CatalogRef.кфкПродюсеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИсходныхДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеРегистрации</name>
    <type>
      <types>EnumRef.кфкСобытияРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлОбработкиМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЖурнала</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаИзмененияМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>КлючЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРегистрацииМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/кфкСтатусыСообщений/кфкСтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>кфкСтатусыСообщений</name>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаОтменена</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>Выгружено</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаВыгрузки</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/кфкИсходящиеСообщения/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Сбросить статус ошибки.
// 
// Параметры:
//  КлючиЗаписей - Массив Из РегистрСведенийКлючЗаписи.кфкИсходящиеСообщения - Ключи записей
Процедура СброситьСтатусОшибки(КлючиЗаписей) Экспорт
	
	Очередь = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкИсходящиеСообщения); // РегистрСведенийНаборЗаписей.кфкИсходящиеСообщения
	
	//@skip-check invocation-parameter-type-intersect
	Таблица = Очередь.Выгрузить(, "КлючЗаписи,ДатаРегистрацииМС");
	
	Для Каждого КлючЗаписей Из КлючиЗаписей Цикл
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), КлючЗаписей);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.КлючЗаписи КАК КлючЗаписи,
	|	Т.ДатаРегистрацииМС КАК ДатаРегистрацииМС
	|ПОМЕСТИТЬ ВТКлючиЗаписей
	|ИЗ
	|	&Таблица КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсходящиеСообщения.КлючЗаписи КАК КлючЗаписи,
	|	ИсходящиеСообщения.ДатаРегистрацииМС КАК ДатаРегистрацииМС,
	|	ВЫБОР
	|		КОГДА ИсходящиеСообщения.Статус = ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаОбработки)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Новое)
	|		КОГДА ИсходящиеСообщения.Статус = ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаВыгрузки)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Обработано)
	|	КОНЕЦ КАК Статус,
	|	ИсходящиеСообщения.ИсходныеДанные КАК ИсходныеДанные,
	|	ИсходящиеСообщения.ЭтоУдаление КАК ЭтоУдаление,
	|	ИсходящиеСообщения.КлючСообщения КАК КлючСообщения,
	|	ИсходящиеСообщения.Заголовки КАК Заголовки,
	|	ИсходящиеСообщения.ТелоСообщения КАК ТелоСообщения,
	|	ИсходящиеСообщения.Продюсер КАК Продюсер,
	|	ИсходящиеСообщения.ТипОбъект КАК ТипОбъект,
	|	ИсходящиеСообщения.ТипИсходныхДанных КАК ТипИсходныхДанных,
	|	ИсходящиеСообщения.КлючОбъекта КАК КлючОбъекта,
	|	ИсходящиеСообщения.СобытиеРегистрации КАК СобытиеРегистрации,
	|	ИсходящиеСообщения.ДатаРегистрации КАК ДатаРегистрации,
	|	ИсходящиеСообщения.ДатаОбработки КАК ДатаОбработки,
	|	ИсходящиеСообщения.ДлОбработкиМС КАК ДлОбработкиМС,
	|	ИсходящиеСообщения.ДатаВыгрузки КАК ДатаВыгрузки,
	|	ИсходящиеСообщения.ТекстЖурнала КАК ТекстЖурнала
	|ИЗ
	|	ВТКлючиЗаписей КАК ВТКлючиЗаписей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.кфкИсходящиеСообщения КАК ИсходящиеСообщения
	|		ПО ВТКлючиЗаписей.КлючЗаписи = ИсходящиеСообщения.КлючЗаписи
	|		И ВТКлючиЗаписей.ДатаРегистрацииМС = ИсходящиеСообщения.ДатаРегистрацииМС
	|ГДЕ
	|	ИсходящиеСообщения.Статус В (ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаОбработки),
	|		ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаВыгрузки))";
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Очередь.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.МеткаИзмененияМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
	КонецЦикла;
	
	Очередь.Записать(РежимЗамещения.Обновление);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
